app/views/api/v1/categories/show.json.jbuilder


json.albums @category.albums.each do |album|
---
SELECT "albums".* FROM "albums" WHERE "albums"."category_id" = $1  [["category_id", 1]]