app/views/api/v1/search/index.json.jbuilder

json.songs @songs.each do |song|
---
SELECT "songs".* FROM "songs" WHERE (title LIKE '%%')


json.albums @artists.each do |artist|
---
SELECT "albums".* FROM "albums" WHERE (title LIKE '%%')