app/controllers/api/v1/dashboard_controller.rb

SELECT "recently_heards".* FROM "recently_heards" WHERE "recently_heards"."user_id" = $1 ORDER BY created_at DESC LIMIT $2  [["user_id", 5], ["LIMIT", 4]]
---
    def load_recent_heard
        #o current_user é uma variavel do devise token auth, usuario atual q esta logado!
        @recent_albums = current_user.recently_heards.order('created_at DESC').limit(4).map(&:album)

SELECT distinct albums.* FROM "albums" INNER JOIN "categories" ON "categories"."id" = "albums"."category_id" INNER JOIN "songs" ON "songs"."album_id" = "albums"."id" WHERE "albums"."category_id" IN ($1, $2, $3, $4) ORDER BY songs.played_count LIMIT $5  [["category_id", 1], ["category_id", 1], ["category_id", 2], ["category_id", 4], ["LIMIT", 12]]
SELECT "albums".* FROM "albums"
---
    def load_recomendations
        heard_categories = @recent_albums.map(&:category)#o .map aqui serve pra pegar relações entre tabelas de forma facil
        # tipo voce pega aqui os albuns ouvidos recentemente, mas eu quero as categorias desses albuns
        # pra nao usar o join ou outra relacao com chave estrangeira, o .map retorna tudo isso dentro de um array facinho
    if heard_categories.present?
        @recomend_albums = Album.joins(:category, :songs).where(category: heard_categories).order('songs.played_count').select('distinct albums.*').limit(12)
    else
        @recomend_albums = Album.all.sample(12)