app/controllers/api/v1/favorites_controller.rb

    def index
        @favorites_albums = current_user.favorites.where(favoritable_type: "Album").map(&:favoritable)
        @favorites_songs = current_user.favorites.where(favoritable_type: "Song").map(&:favoritable)
        @favorites_artists = current_user.favorites.where(favoritable_type: "Artist").map(&:favoritable)
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."favoritable_type" = $2  [["user_id", 1], ["favoritable_type", "Album"]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."favoritable_type" = $2  [["user_id", 1], ["favoritable_type", "Song"]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."favoritable_type" = $2  [["user_id", 1], ["favoritable_type", "Artist"]]